Janadasroor/VioAVR/atmega/include/avr/ioms64m1.h
#define ICR1L   _SFR_MEM8(0x86)
#define ICR1H   _SFR_MEM8(0x87)

/* Combine OCR1AL and OCR1AH */
#define OCR1A   _SFR_MEM16(0x88)

#define OCR1AL  _SFR_MEM8(0x88)
#define OCR1AH  _SFR_MEM8(0x89)

/* Combine OCR1BL and OCR1BH */
#define OCR1B   _SFR_MEM16(0x8A)

#define OCR1BL  _SFR_MEM8(0x8A)
#define OCR1BH  _SFR_MEM8(0x8B)

/* Reserved [0x8C..0x8F] */

#define DACON   _SFR_MEM8(0x90)
#define DAEN    0
#define DAOE    1
#define DALA    2
#define DATS0   4
#define DATS1   5
#define DATS2   6
#define DAATE   7

/* Combine DACL and DACH */
#define DAC     _SFR_MEM16(0x91)

#define DACL    _SFR_MEM8(0x91)
#define DAC0    0
#define DAC1    1
#define DAC2    2
#define DAC3    3
#define DAC4    4
#define DAC5    5
#define DAC6    6
#define DAC7    7
#define DACH    _SFR_MEM8(0x92)
#define DAC8    0
#define DAC9    1
#define DAC10   2
#define DAC11   3
#define DAC12   4
#define DAC13   5
#define DAC14   6
#define DAC15   7

/* Reserved [0x93] */

#define AC0CON  _SFR_MEM8(0x94)
#define AC0M0   0
#define AC0M1   1
#define AC0M2   2
#define ACCKSEL 3
#define AC0IS0  4
#define AC0IS1  5
#define AC0IE   6
#define AC0EN   7

#define AC1CON  _SFR_MEM8(0x95)
#define AC1M0   0
#define AC1M1   1
#define AC1M2   2
#define AC1ICE  3
#define AC1IS0  4
#define AC1IS1  5
#define AC1IE   6
#define AC1EN   7

#define AC2CON  _SFR_MEM8(0x96)
#define AC2M0   0
#define AC2M1   1
#define AC2M2   2
#define AC2IS0  4
#define AC2IS1  5
#define AC2IE   6
#define AC2EN   7

#define AC3CON  _SFR_MEM8(0x97)
#define AC3M0   0
#define AC3M1   1
#define AC3M2   2
#define AC3IS0  4
#define AC3IS1  5
#define AC3IE   6
#define AC3EN   7

/* Reserved [0x98..0x9F] */

/* Combine POCR0SAL and POCR0SAH */
#define POCR0SA _SFR_MEM16(0xA0)

#define POCR0SAL _SFR_MEM8(0xA0)
#define POCR0SAH _SFR_MEM8(0xA1)

/* Combine POCR0RAL and POCR0RAH */
#define POCR0RA _SFR_MEM16(0xA2)

#define POCR0RAL _SFR_MEM8(0xA2)
#define POCR0RAH _SFR_MEM8(0xA3)

/* Combine POCR0SBL and POCR0SBH */
#define POCR0SB _SFR_MEM16(0xA4)

#define POCR0SBL _SFR_MEM8(0xA4)
#define POCR0SBH _SFR_MEM8(0xA5)

/* Combine POCR1SAL and POCR1SAH */
#define POCR1SA _SFR_MEM16(0xA6)

#define POCR1SAL _SFR_MEM8(0xA6)
#define POCR1SAH _SFR_MEM8(0xA7)

/* Combine POCR1RAL and POCR1RAH */
#define POCR1RA _SFR_MEM16(0xA8)

#define POCR1RAL _SFR_MEM8(0xA8)
#define POCR1RAH _SFR_MEM8(0xA9)

/* Combine POCR1SBL and POCR1SBH */
#define POCR1SB _SFR_MEM16(0xAA)

#define POCR1SBL _SFR_MEM8(0xAA)
#define POCR1SBH _SFR_MEM8(0xAB)

/* Combine POCR2SAL and POCR2SAH */
#define POCR2SA _SFR_MEM16(0xAC)

#define POCR2SAL _SFR_MEM8(0xAC)
#define POCR2SAH _SFR_MEM8(0xAD)

/* Combine POCR2RAL and POCR2RAH */
#define POCR2RA _SFR_MEM16(0xAE)

#define POCR2RAL _SFR_MEM8(0xAE)
#define POCR2RAH _SFR_MEM8(0xAF)

/* Combine POCR2SBL and POCR2SBH */
#define POCR2SB _SFR_MEM16(0xB0)

#define POCR2SBL _SFR_MEM8(0xB0)
#define POCR2SBH _SFR_MEM8(0xB1)

/* Combine POCR_RBL and POCR_RBH */
#define POCR_RB _SFR_MEM16(0xB2)

#define POCR_RBL _SFR_MEM8(0xB2)
#define POCR_RBH _SFR_MEM8(0xB3)

#define PSYNC   _SFR_MEM8(0xB4)
#define PSYNC00 0
#define PSYNC01 1
#define PSYNC10 2
#define PSYNC11 3
#define PSYNC20 4
#define PSYNC21 5

#define PCNF    _SFR_MEM8(0xB5)
#define POPA    2
#define POPB    3
#define PMODE   4
#define PULOCK  5

#define POC     _SFR_MEM8(0xB6)
#define POEN0A  0
#define POEN0B  1
#define POEN1A  2
#define POEN1B  3
#define POEN2A  4
#define POEN2B  5

#define PCTL    _SFR_MEM8(0xB7)
#define PRUN    0
#define PCCYC   1
#define PCLKSEL 5
#define PPRE0   6
#define PPRE1   7

#define PMIC0   _SFR_MEM8(0xB8)
#define PRFM00  0
#define PRFM01  1
#define PRFM02  2
#define PAOC0   3
#define PFLTE0  4
#define PELEV0  5
#define PISEL0  6
#define POVEN0  7

#define PMIC1   _SFR_MEM8(0xB9)
#define PRFM10  0
#define PRFM11  1
#define PRFM12  2
#define PAOC1   3
#define PFLTE1  4
#define PELEV1  5
#define PISEL1  6
#define POVEN1  7

#define PMIC2   _SFR_MEM8(0xBA)
#define PRFM20  0
#define PRFM21  1
#define PRFM22  2
#define PAOC2   3
#define PFLTE2  4
#define PELEV2  5
#define PISEL2  6
#define POVEN2  7

#define PIM     _SFR_MEM8(0xBB)
#define PEOPE   0
#define PEVE0   1
#define PEVE1   2
#define PEVE2   3

#define PIFR    _SFR_MEM8(0xBC)
#define PEOP    0
#define PEV0    1
#define PEV1    2
#define PEV2    3

/* Reserved [0xBD..0xC7] */

#define LINCR   _SFR_MEM8(0xC8)
#define LCMD0   0
#define LCMD1   1
#define LCMD2   2
#define LENA    3
#define LCONF0  4
#define LCONF1  5
#define LIN13   6
#define LSWRES  7

#define LINSIR  _SFR_MEM8(0xC9)
#define LRXOK   0
#define LTXOK   1
#define LIDOK   2
#define LERR    3
#define LBUSY   4
#define LIDST0  5
#define LIDST1  6
#define LIDST2  7

#define LINENIR _SFR_MEM8(0xCA)
#define LENRXOK 0
#define LENTXOK 1
#define LENIDOK 2
#define LENERR  3

#define LINERR  _SFR_MEM8(0xCB)
#define LBERR   0
#define LCERR   1
#define LPERR   2
#define LSERR   3
#define LFERR   4
#define LOVERR  5
#define LTOERR  6
#define LABORT  7

#define LINBTR  _SFR_MEM8(0xCC)
#define LBT0    0
#define LBT1    1
#define LBT2    2
#define LBT3    3
#define LBT4    4
#define LBT5    5
#define LDISR   7

/* Combine LINBRRL and LINBRRH */
#define LINBRR  _SFR_MEM16(0xCD)

#define LINBRRL _SFR_MEM8(0xCD)
#define LDIV0   0
#define LDIV1   1
#define LDIV2   2
#define LDIV3   3
#define LDIV4   4
#define LDIV5   5
#define LDIV6   6
#define LDIV7   7
#define LINBRRH _SFR_MEM8(0xCE)
#define LDIV8   0
#define LDIV9   1
#define LDIV10  2
#define LDIV11  3

#define LINDLR  _SFR_MEM8(0xCF)
#define LRXDL0  0
#define LRXDL1  1
#define LRXDL2  2
#define LRXDL3  3
#define LTXDL0  4
#define LTXDL1  5
#define LTXDL2  6
#define LTXDL3  7

#define LINIDR  _SFR_MEM8(0xD0)
#define LID0    0
#define LID1    1
#define LID2    2
#define LID3    3
#define LID4    4
#define LID5    5
#define LP0     6
#define LP1     7

#define LINSEL  _SFR_MEM8(0xD1)
#define LINDX0  0
#define LINDX1  1
#define LINDX2  2
#define LAINC   3

#define LINDAT  _SFR_MEM8(0xD2)
#define LDATA0  0
#define LDATA1  1
#define LDATA2  2
#define LDATA3  3
#define LDATA4  4
#define LDATA5  5
#define LDATA6  6
#define LDATA7  7

/* Reserved [0xD3..0xD7] */

#define CANGCON _SFR_MEM8(0xD8)
#define SWRES   0
#define ENASTB  1
#define TEST    2
#define LISTEN  3
#define SYNTTC  4
#define TTC     5
#define OVRQ    6
#define ABRQ    7

#define CANGSTA _SFR_MEM8(0xD9)
#define ERRP    0
#define BOFF    1
#define ENFG    2
#define RXBSY   3
#define TXBSY   4
#define OVFG    6

#define CANGIT  _SFR_MEM8(0xDA)
#define AERG    0
#define FERG    1
#define CERG    2
#define SERG    3
#define BXOK    4
#define OVRTIM  5
#define BOFFIT  6
#define CANIT   7

