Janadasroor/VioAVR/atmega/include/avr/ioms64m1.h
#define CANGIE  _SFR_MEM8(0xDB)
#define ENOVRT  0
#define ENERG   1
#define ENBX    2
#define ENERR   3
#define ENTX    4
#define ENRX    5
#define ENBOFF  6
#define ENIT    7

#define CANEN2  _SFR_MEM8(0xDC)
#define ENMOB0  0
#define ENMOB1  1
#define ENMOB2  2
#define ENMOB3  3
#define ENMOB4  4
#define ENMOB5  5

#define CANEN1  _SFR_MEM8(0xDD)

#define CANIE2  _SFR_MEM8(0xDE)
#define IEMOB0  0
#define IEMOB1  1
#define IEMOB2  2
#define IEMOB3  3
#define IEMOB4  4
#define IEMOB5  5

#define CANIE1  _SFR_MEM8(0xDF)

#define CANSIT2 _SFR_MEM8(0xE0)
#define SIT0    0
#define SIT1    1
#define SIT2    2
#define SIT3    3
#define SIT4    4
#define SIT5    5

#define CANSIT1 _SFR_MEM8(0xE1)

#define CANBT1  _SFR_MEM8(0xE2)
#define BRP0    1
#define BRP1    2
#define BRP2    3
#define BRP3    4
#define BRP4    5
#define BRP5    6

#define CANBT2  _SFR_MEM8(0xE3)
#define PRS0    1
#define PRS1    2
#define PRS2    3
#define SJW0    5
#define SJW1    6

#define CANBT3  _SFR_MEM8(0xE4)
#define SMP     0
#define PHS10   1
#define PHS11   2
#define PHS12   3
#define PHS20   4
#define PHS21   5
#define PHS22   6

#define CANTCON _SFR_MEM8(0xE5)

/* Combine CANTIML and CANTIMH */
#define CANTIM  _SFR_MEM16(0xE6)

#define CANTIML _SFR_MEM8(0xE6)
#define CANTIMH _SFR_MEM8(0xE7)

/* Combine CANTTCL and CANTTCH */
#define CANTTC  _SFR_MEM16(0xE8)

#define CANTTCL _SFR_MEM8(0xE8)
#define CANTTCH _SFR_MEM8(0xE9)

#define CANTEC  _SFR_MEM8(0xEA)

#define CANREC  _SFR_MEM8(0xEB)

#define CANHPMOB _SFR_MEM8(0xEC)
#define CGP0    0
#define CGP1    1
#define CGP2    2
#define CGP3    3
#define HPMOB0  4
#define HPMOB1  5
#define HPMOB2  6
#define HPMOB3  7

#define CANPAGE _SFR_MEM8(0xED)
#define INDX0   0
#define INDX1   1
#define INDX2   2
#define AINC    3
#define MOBNB0  4
#define MOBNB1  5
#define MOBNB2  6
#define MOBNB3  7

#define CANSTMOB _SFR_MEM8(0xEE)
#define AERR    0
#define FERR    1
#define CERR    2
#define SERR    3
#define BERR    4
#define RXOK    5
#define TXOK    6
#define DLCW    7

#define CANCDMOB _SFR_MEM8(0xEF)
#define DLC0    0
#define DLC1    1
#define DLC2    2
#define DLC3    3
#define IDE     4
#define RPLV    5
#define CONMOB0 6
#define CONMOB1 7

#define CANIDT4 _SFR_MEM8(0xF0)
#define RB0TAG  0
#define RB1TAG  1
#define RTRTAG  2
#define IDT0    3
#define IDT1    4
#define IDT2    5
#define IDT3    6
#define IDT4    7

#define CANIDT3 _SFR_MEM8(0xF1)
#define IDT5    0
#define IDT6    1
#define IDT7    2
#define IDT8    3
#define IDT9    4
#define IDT10   5
#define IDT11   6
#define IDT12   7

#define CANIDT2 _SFR_MEM8(0xF2)
#define IDT13   0
#define IDT14   1
#define IDT15   2
#define IDT16   3
#define IDT17   4
#define IDT18   5
#define IDT19   6
#define IDT20   7

#define CANIDT1 _SFR_MEM8(0xF3)
#define IDT21   0
#define IDT22   1
#define IDT23   2
#define IDT24   3
#define IDT25   4
#define IDT26   5
#define IDT27   6
#define IDT28   7

#define CANIDM4 _SFR_MEM8(0xF4)
#define IDEMSK  0
#define RTRMSK  2
#define IDMSK0  3
#define IDMSK1  4
#define IDMSK2  5
#define IDMSK3  6
#define IDMSK4  7

#define CANIDM3 _SFR_MEM8(0xF5)
#define IDMSK5  0
#define IDMSK6  1
#define IDMSK7  2
#define IDMSK8  3
#define IDMSK9  4
#define IDMSK10 5
#define IDMSK11 6
#define IDMSK12 7

#define CANIDM2 _SFR_MEM8(0xF6)
#define IDMSK13 0
#define IDMSK14 1
#define IDMSK15 2
#define IDMSK16 3
#define IDMSK17 4
#define IDMSK18 5
#define IDMSK19 6
#define IDMSK20 7

#define CANIDM1 _SFR_MEM8(0xF7)
#define IDMSK21 0
#define IDMSK22 1
#define IDMSK23 2
#define IDMSK24 3
#define IDMSK25 4
#define IDMSK26 5
#define IDMSK27 6
#define IDMSK28 7

/* Combine CANSTML and CANSTMH */
#define CANSTM  _SFR_MEM16(0xF8)

#define CANSTML _SFR_MEM8(0xF8)
#define CANSTMH _SFR_MEM8(0xF9)

#define CANMSG  _SFR_MEM8(0xFA)



/* Values and associated defines */


#define SLEEP_MODE_IDLE (0x00<<1)
#define SLEEP_MODE_ADC (0x01<<1)
#define SLEEP_MODE_PWR_DOWN (0x02<<1)
#define SLEEP_MODE_STANDBY (0x06<<1)

/* Interrupt vectors */
/* Vector 0 is the reset vector */
/* Analog Comparator 0 */
#define ANACOMP0_vect            _VECTOR(1)
#define ANACOMP0_vect_num        1

/* Analog Comparator 1 */
#define ANACOMP1_vect            _VECTOR(2)
#define ANACOMP1_vect_num        2

/* Analog Comparator 2 */
#define ANACOMP2_vect            _VECTOR(3)
#define ANACOMP2_vect_num        3

/* Analog Comparator 3 */
#define ANACOMP3_vect            _VECTOR(4)
#define ANACOMP3_vect_num        4

/* PSC Fault */
#define PSC_FAULT_vect            _VECTOR(5)
#define PSC_FAULT_vect_num        5

/* PSC End of Cycle */
#define PSC_EC_vect            _VECTOR(6)
#define PSC_EC_vect_num        6

/* External Interrupt Request 0 */
#define INT0_vect            _VECTOR(7)
#define INT0_vect_num        7

/* External Interrupt Request 1 */
#define INT1_vect            _VECTOR(8)
#define INT1_vect_num        8

/* External Interrupt Request 2 */
#define INT2_vect            _VECTOR(9)
#define INT2_vect_num        9

/* External Interrupt Request 3 */
#define INT3_vect            _VECTOR(10)
#define INT3_vect_num        10

/* Timer/Counter1 Capture Event */
#define TIMER1_CAPT_vect            _VECTOR(11)
#define TIMER1_CAPT_vect_num        11

/* Timer/Counter1 Compare Match A */
#define TIMER1_COMPA_vect            _VECTOR(12)
#define TIMER1_COMPA_vect_num        12

/* Timer/Counter1 Compare Match B */
#define TIMER1_COMPB_vect            _VECTOR(13)
#define TIMER1_COMPB_vect_num        13

/* Timer1/Counter1 Overflow */
#define TIMER1_OVF_vect            _VECTOR(14)
#define TIMER1_OVF_vect_num        14

/* Timer/Counter0 Compare Match A */
#define TIMER0_COMPA_vect            _VECTOR(15)
#define TIMER0_COMPA_vect_num        15

/* Timer/Counter0 Compare Match B */
#define TIMER0_COMPB_vect            _VECTOR(16)
#define TIMER0_COMPB_vect_num        16

/* Timer/Counter0 Overflow */
#define TIMER0_OVF_vect            _VECTOR(17)
#define TIMER0_OVF_vect_num        17

/* CAN MOB, Burst, General Errors */
#define CAN_INT_vect            _VECTOR(18)
#define CAN_INT_vect_num        18

/* CAN Timer Overflow */
#define CAN_TOVF_vect            _VECTOR(19)
#define CAN_TOVF_vect_num        19

