Janadasroor/VioAVR/atmega/include/avr/ioms64m1.h
/* LIN Transfer Complete */
#define LIN_TC_vect            _VECTOR(20)
#define LIN_TC_vect_num        20

/* LIN Error */
#define LIN_ERR_vect            _VECTOR(21)
#define LIN_ERR_vect_num        21

/* Pin Change Interrupt Request 0 */
#define PCINT0_vect            _VECTOR(22)
#define PCINT0_vect_num        22

/* Pin Change Interrupt Request 1 */
#define PCINT1_vect            _VECTOR(23)
#define PCINT1_vect_num        23

/* Pin Change Interrupt Request 2 */
#define PCINT2_vect            _VECTOR(24)
#define PCINT2_vect_num        24

/* Pin Change Interrupt Request 3 */
#define PCINT3_vect            _VECTOR(25)
#define PCINT3_vect_num        25

/* SPI Serial Transfer Complete */
#define SPI_STC_vect            _VECTOR(26)
#define SPI_STC_vect_num        26

/* ADC Conversion Complete */
#define ADC_vect            _VECTOR(27)
#define ADC_vect_num        27

/* Watchdog Time-Out Interrupt */
#define WDT_vect            _VECTOR(28)
#define WDT_vect_num        28

/* EEPROM Ready */
#define EE_READY_vect            _VECTOR(29)
#define EE_READY_vect_num        29

/* Store Program Memory Read */
#define SPM_READY_vect            _VECTOR(30)
#define SPM_READY_vect_num        30

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define _VECTORS_SIZE 124
#else
#  define _VECTORS_SIZE 124U
#endif


/* Constants */

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define SPM_PAGESIZE 256
#  define FLASHSTART   0x0000
#  define FLASHEND     0xFFFF
#else
#  define SPM_PAGESIZE 256U
#  define FLASHSTART   0x0000U
#  define FLASHEND     0xFFFFU
#endif
#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define RAMSTART     0x0100
#  define RAMSIZE      4096
#  define RAMEND       0x10FF
#else
#  define RAMSTART     0x0100U
#  define RAMSIZE      4096U
#  define RAMEND       0x10FFU
#endif
#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define E2START     0
#  define E2SIZE      2048
#  define E2PAGESIZE  8
#  define E2END       0x07FF
#else
#  define E2START     0U
#  define E2SIZE      2048U
#  define E2PAGESIZE  8U
#  define E2END       0x07FFU
#endif
#define XRAMEND      RAMEND


/* Fuses */

#define FUSE_MEMORY_SIZE 3

/* Low Fuse Byte */
#define FUSE_SUT_CKSEL0  (unsigned char)~_BV(0)
#define FUSE_SUT_CKSEL1  (unsigned char)~_BV(1)
#define FUSE_SUT_CKSEL2  (unsigned char)~_BV(2)
#define FUSE_SUT_CKSEL3  (unsigned char)~_BV(3)
#define FUSE_SUT_CKSEL4  (unsigned char)~_BV(4)
#define FUSE_SUT_CKSEL5  (unsigned char)~_BV(5)
#define FUSE_CKOUT       (unsigned char)~_BV(6)
#define FUSE_CKDIV8      (unsigned char)~_BV(7)
#define LFUSE_DEFAULT    (FUSE_SUT_CKSEL0 & FUSE_SUT_CKSEL2 & FUSE_SUT_CKSEL3 & FUSE_SUT_CKSEL4 & FUSE_CKDIV8)


/* High Fuse Byte */
#define FUSE_BOOTRST     (unsigned char)~_BV(0)
#define FUSE_BOOTSZ0     (unsigned char)~_BV(1)
#define FUSE_BOOTSZ1     (unsigned char)~_BV(2)
#define FUSE_EESAVE      (unsigned char)~_BV(3)
#define FUSE_WDTON       (unsigned char)~_BV(4)
#define FUSE_SPIEN       (unsigned char)~_BV(5)
#define FUSE_DWEN        (unsigned char)~_BV(6)
#define FUSE_RSTDISBL    (unsigned char)~_BV(7)
#define HFUSE_DEFAULT    (FUSE_BOOTSZ0 & FUSE_BOOTSZ1 & FUSE_SPIEN)


/* Extended Fuse Byte */
#define FUSE_BODLEVEL0   (unsigned char)~_BV(0)
#define FUSE_BODLEVEL1   (unsigned char)~_BV(1)
#define FUSE_BODLEVEL2   (unsigned char)~_BV(2)
#define FUSE_PSCRVB      (unsigned char)~_BV(3)
#define FUSE_PSCRVA      (unsigned char)~_BV(4)
#define FUSE_PSCRB       (unsigned char)~_BV(5)
#define EFUSE_DEFAULT    (0xFF)



/* Lock Bits */
#define __LOCK_BITS_EXIST
#define __BOOT_LOCK_BITS_0_EXIST
#define __BOOT_LOCK_BITS_1_EXIST


/* Signature */
#define SIGNATURE_0 0x1E
#define SIGNATURE_1 0x96
#define SIGNATURE_2 0x84




#endif /* #ifdef _AVR_ATMEGAS64M1_H_INCLUDED */

